[
 {
 "id": 1,
 "name": "1v1 Lol",
 "image": "images/1v1lolimage.jpg",
 "slug": "1v1lol",
 "gameurl": "https://1v1.lol/",
 "tags": ["shooter", "action", "multiplayer"],
 "description": "1v1.LOL is an online third-person shooter with cool building mechanics. Battle royale, build battle, box fight, zone wars and more game modes to enjoy!"
 },
 {
 "id": 2,
 "name": "3D Formula Racing",
 "image": "images/3dformularacingimage.jpg",
 "slug": "3dformularacing",
 "gameurl": "https://html5.gamemonetize.co/tia5pbecnefai0pnlkapzyzzfh0yobn4/",
 "tags": ["racing", "cars", "3d"],
 "description": "Feel the excitement of Formula 1 in this fast-paced 3D racing adventure. Take on tricky tracks filled with twists and turns while pushing your skills to the limit. Compete head-to-head with rival drivers in a battle for speed and precision. Cross the finish line first to claim victory and prove yourself as the ultimate racer."
 },
 {
 "id": 3,
 "name": "Basket Random",
 "image": "images/basketrandomimage.jpg",
 "slug": "basketrandom",
 "gameurl": "https://html5.gamemonetize.co/anaaahgt57d5t2tddrbc1m4qq97vz1jd/",
 "tags": ["2 player", "basketball", "sports"],
 "description": "Basket Random is a lighthearted basketball game that uses ragdoll-style physics for hilarious gameplay. You can challenge a friend or face off against the computer in unpredictable matches. Each game is full of surprises, making every round unique and entertaining. It’s a chaotic twist on basketball where skill and randomness collide."
 },
 {
 "id": 4,
 "name": "Cookie Clicker",
 "image": "images/cookieclickerimage.jpg",
 "slug": "cookieclicker",
 "gameurl": "https://html5.gamemonetize.co/z5n072q7gj0w969r5ul4ignnxe0fzsun/",
 "tags": ["clicker", "idle", "cooking"],
 "description": "This is the classic idle clicker game that started it all. Simply click on cookies to collect points and unlock upgrades that boost your production. As you progress, your cookies begin generating automatically, allowing you to expand even faster. The challenge is to see just how many cookies you can create!"
 },
 {
 "id": 5,
 "name": "Cube Arena 2048",
 "image": "images/cubearenaimage.jpg",
 "slug": "cubearena2048",
 "gameurl": "https://html5.gamemonetize.co/83up5y2u78nvd5ngywugy6j4g3im4lda/",
 "tags": ["3d", "2048", "io"],
 "description": "This game puts a 3D spin on the classic 2048 puzzle. Move and merge cubes with identical numbers to form higher-value blocks. The added dimension creates fresh challenges and strategic opportunities. Test your puzzle-solving skills as you work to reach the highest numbers in a 3D arena."
 },
 {
 "id": 6,
 "name": "Draw Climber",
 "image": "images/drawclimberimage.jpg",
 "slug": "drawclimber",
 "gameurl": "https://html5.gamemonetize.co/0lkapk5bhk46tk0s8d971iyarszc8ib8/",
 "tags": ["puzzle", "drawing", "runner"],
 "description": "Draw legs for your character to help them climb over obstacles! Each obstacle requires different leg shapes, so be creative with your drawings!"
 },
 {
 "id": 7,
 "name": "Fruit Merge",
 "image": "images/fruitmergeimage.jpg",
 "slug": "fruitmerge",
 "gameurl": "https://html5.gamemonetize.co/rgz7sjhynwsheffgv4ijzz1nj2oa1nur/",
 "tags": ["satisfying", "puzzle", "fruit"],
 "description": "In this calming puzzle game, you drop fruits and merge matching ones to form larger varieties. As the smaller fruits come together, they transform into bigger and more rewarding creations. The gameplay is simple yet addictive, offering a relaxing experience. Enjoy watching your fruit collection grow with every clever move you make."
 },
 {
 "id": 8,
 "name": "Helix Jump",
 "image": "images/helixjumpimage.jpg",
 "slug": "helixjump",
 "gameurl": "https://html5.gamemonetize.co/ghzimuehf6yw4vkdaywk1s9x3mrbgq0w/",
 "tags": ["arcade", "endless", "platformer"],
 "description": "Guide the ball as it bounces down through a twisting helix tower. Carefully avoid the colored platforms that can end your run. The goal is to keep descending as far as possible without slipping up. See how deep you can go in this fast-paced challenge!"
 },
 {
 "id": 9,
 "name": "Masked Special Forces",
 "image": "images/maskedspecialforcesimage.jpg",
 "slug": "maskedspecialforces",
 "gameurl": "https://html5.gamemonetize.co/1s10wsxntjub41qo2puh7jlx3qmbvh5t/",
 "tags": ["shooter", "online", "multiplayer"],
 "description": "Step into the role of an elite special forces soldier in this action-packed multiplayer shooter. Team up with other players to tackle strategic missions and intense firefights. Each match presents different combat situations that test your coordination and skill. Work together to outsmart opponents and secure victory on the battlefield."
 },
 {
 "id": 10,
 "name": "Paper Io",
 "image": "images/paperioimage.jpg",
 "slug": "paperio",
 "gameurl": "https://html5.gamemonetize.co/1skj7a1hu68a1p31ag4ywljq4gb18oma/",
 "tags": ["io", "strategy", "multiplayer"],
 "description": "Dominate the map in this engaging io game by claiming as much territory as you can. Draw lines to expand your area while staying cautious of other players who can cut you off. Strategy and quick reflexes are key to staying ahead. See how much land you can capture before someone takes you down!"
 },
 {
 "id": 11,
 "name": "Parkour Block 3D",
 "image": "images/parkourblock3dimage.jpg",
 "slug": "parkourblock3d",
 "gameurl": "https://html5.gamemonetize.co/hrsxh2clxg229ty294gdlbjzeejglgmp/",
 "tags": ["parkour", "3d", "platformer"],
 "description": "Hone your parkour skills in this immersive 3D block universe. Leap, slide, and climb your way through intricate obstacle courses. Each level challenges your timing and agility, pushing your reflexes to the limit. See how far you can go while mastering every jump and movement."
 },
 {
 "id": 12,
 "name": "Poly Track",
 "image": "images/polytrackimage.jpg",
 "slug": "polytrack",
 "gameurl": "https://www.kodub.com/apps/polytrack",
 "tags": ["racing", "cars", "online"],
 "description": "Speed through sleek low-poly tracks in this contemporary racing experience. Tackle challenging courses that test your precision and control. Realistic physics make every turn and drift feel authentic. Push your skills to the limit as you race toward victory."
 },
 {
 "id": 13,
 "name": "Rodeo Stampede",
 "image": "images/rodeostampedeimage.jpg",
 "slug": "rodeostampede",
 "gameurl": "https://html5.gamemonetize.co/p4y8uwto5cchbs371ua7hxqzidihi213/",
 "tags": ["adventure", "animal", "racing"],
 "description": "Embark on an endless adventure where you lasso and tame wild animals. Ride majestic creatures like buffalo and elephants while navigating the challenges of the savanna. Dodge obstacles and explore the vast, untamed landscape. See how far you can go as you master each ride and adventure."
 },
 {
 "id": 14,
 "name": "Spiral Roll",
 "image": "images/spiralrollimage.jpg",
 "slug": "spiralroll",
 "gameurl": "https://html5.gamemonetize.co/fq17wpd1ygq5kppyqq9souztit8jlkk0/",
 "tags": ["platformer", "satisfying", "3d"],
 "description": "Smash through the spiral tower using your bouncing ball. Guide it carefully down the vibrant, twisting path while dodging obstacles. The combination of movement and impact creates a surprisingly satisfying experience. Keep going to see how far you can break through!"
 },
 {
 "id": 15,
 "name": "Subway Surfers",
 "image": "images/subwaysurfersimage.jpg",
 "slug": "subwaysurfers",
 "gameurl": "https://html5.gamemonetize.co/du2cejdc5we8szc7vgfdatel08oxr0zg/",
 "tags": ["endless", "platformer", "parkour"],
 "description": "Sprint through the subway in this thrilling endless runner game. Dodge oncoming trains, grab coins, and glide along the tracks. Stay one step ahead of the grumpy inspector as you navigate each obstacle. How far can you push your speed and reflexes?"
 },
 {
 "id": 16,
 "name": "Tiny Fishing",
 "image": "images/tinyfishingimage.jpg",
 "slug": "tinyfishing",
 "gameurl": "https://html5.gamemonetize.co/hzvsxelbew3y0v09vyql2n40kgtziqyg/",
 "tags": ["idle", "fishing", "clicker"],
 "description": "Enjoy a calming fishing experience in this idle game where you simply cast your line and wait for a catch. Upgrade your gear to improve your chances and explore deeper waters. Discover a variety of fish species as you progress. Relax and see how many fish you can reel in over time."
 },
 {
 "id": 17,
 "name": "Bloxd io",
 "image": "images/bloxdioimage.jpg",
 "slug": "bloxdio",
 "gameurl": "https://bloxd.io/",
 "tags": ["io", "parkour", "multiplayer"],
 "description": "Block-style battle royale with parkour elements! Build, fight, and survive against other players in this unique multiplayer experience."
 },
 {
 "id": 18,
 "name": "Moto X3M",
 "image": "images/motox3mimage.jpg",
 "slug": "motox3m",
 "gameurl": "https://html5.gamemonetize.co/cwvgstrd6an0nqgcf0rdd7phev53fnm1/",
 "tags": ["bike", "racing", "levels"],
 "description": "Take on daring obstacle courses on your dirt bike in this action-packed racing game. Pull off impressive stunts while navigating tricky and hazardous terrain. Each course tests your control and timing to the limit. Push your skills to conquer every challenge and reach the finish line."
 },
 {
 "id": 19,
 "name": "Tall Man Run",
 "image": "images/tallmanrunimage.jpg",
 "slug": "tallmanrun",
 "gameurl": "https://html5.gamemonetize.co/skdbuby5hhfbfz0r7xl3jbcovwhugsfk/",
 "tags": ["3d", "platformer", "runner"],
 "description": "Sprint through exciting levels, growing taller by picking up the right items along the way. Dodge obstacles that can shrink you and slow your progress. The taller you get, the closer you are to victory. Race to the finish line and see how towering you can become!"
 },
 {
 "id": 20,
 "name": "Happy Wheels",
 "image": "images/happywheelsimage.jpg",
 "slug": "happywheels",
 "gameurl": "https://html5.gamemonetize.co/2aibzvt72bgq8i17drkp5y9a6v7a4rq8/",
 "tags": ["adventure", "racing", "sports"],
 "description": "Take on perilous obstacle courses in this physics-driven game. Pick your favorite character and vehicle before tackling the challenges ahead. Carefully maneuver through traps and hazards to avoid crashes. Test your skill and strategy to reach the finish line safely."
 },
 {
 "id": 21,
 "name": "Madalin Stunt Cars Pro",
 "image": "images/madalinstuntcarsproimage.jpg",
 "slug": "madalinstuntcarspro",
 "gameurl": "https://html5.gamemonetize.co/d452kzeh8w8ouiigleba5g52hgu805ls/",
 "tags": ["multiplayer", "racing", "cars"],
 "description": "Show off your driving skills in this adrenaline-filled supercar stunt game. Navigate enormous stunt arenas while performing jaw-dropping tricks. Realistic car physics make each maneuver feel authentic and thrilling. Push your limits to master every stunt and dominate the arena."
 },
 {
 "id": 22,
 "name": "Ice Fishing",
 "image": "images/icefishingimage.jpg",
 "slug": "icefishing",
 "gameurl": "https://html5.gamemonetize.co/ixcjahmstfww53i0yvwn30089nd6e2ay/",
 "tags": ["fishing", "3d", "sports"],
 "description": "Experience the calm of winter in this 3D ice fishing game. Drill through the ice and reel in a variety of fish while surrounded by a serene snowy landscape. The relaxing atmosphere makes each catch satisfying. Test your patience and skill to see how many fish you can catch."
 },
 {
 "id": 23,
 "name": "Stick Fighter",
 "image": "images/stickfighter3dimage.jpg",
 "slug": "stickfighter",
 "gameurl": "https://html5.gamemonetize.co/vlskz7dtsxmpg34pu546de1wjng6ffob/",
 "tags": ["action", "stickman", "2 player"],
 "description": "Jump into thrilling 3D stick figure battles in this action-packed fighting game. Face off against challenging AI opponents or compete with a friend for intense duels. Realistic physics make every punch, kick, and move feel dynamic and exciting. Test your strategy and reflexes to dominate the arena."
 },
 {
 "id": 24,
 "name": "Fruit Ninja",
 "image": "images/fruitninjaimage.jpg",
 "slug": "fruitninja",
 "gameurl": "https://html5.gamemonetize.co/4kci7og3klgj0ivy2wz3gdvd9dth5e7n/",
 "tags": ["fruit", "satisfying", "arcade"],
 "description": "Swipe across the screen to slice juicy fruits in this fun arcade game. Be careful to avoid hidden bombs while aiming for high scores. Each cut is fast-paced and satisfying, keeping you engaged. Challenge yourself to see how many fruits you can slice in a single round."
 },
 {
 "id": 25,
 "name": "Fall Cars: Hexagon",
 "image": "images/fallcarshexagonimage.jpg",
 "slug": "fallcarshexagon",
 "gameurl": "https://html5.gamemonetize.co/5ms4h5xfk8lssrl6iitqdpj8uk4tketp/",
 "tags": ["cars", "2 player", "platformer"],
 "description": "Speed across shifting hexagonal platforms in this intense multiplayer racing game. Avoid falling as the tiles disappear beneath you while competing against other players. The goal is to stay on the track and be the last car remaining. Test your reflexes and strategy to survive and claim victory."
 },
 {
 "id": 26,
 "name": "Ball 2048",
 "image": "images/ball2048image.jpg",
 "slug": "ball2048",
 "gameurl": "https://html5.gamemonetize.co/e3jt923v68e8vninc5fcg8jbzpy4p5tz/",
 "tags": ["2048", "levels", "runner"],
 "description": "Guide your ball through exciting levels in this 2048-inspired runner. Merge with other balls of the same number to grow larger and increase your score. Navigate obstacles while strategically combining balls to reach higher values. See how far you can go as your ball becomes unstoppable."
 },
 {
 "id": 27,
 "name": "Papas Burgeria",
 "image": "images/papasburgeriaimage.jpg",
 "slug": "papasburgeria",
 "gameurl": "https://html5.gamemonetize.co/uw4s71zy0s3jxo6hckel04mw9rbopba8/",
 "tags": ["cooking", "clicker", "arcade"],
 "description": "Manage Papa's burger joint in this fast-paced cooking game. Take customer orders, grill juicy patties, and assemble tasty burgers quickly. Keep up with the rush to satisfy hungry patrons and earn rewards. Test your multitasking skills to run the restaurant smoothly and efficiently."
 },
 {
 "id": 28,
 "name": "Bullet Army Run",
 "image": "images/bulletarmyrunimage.jpg",
 "slug": "bulletarmyrun",
 "gameurl": "https://html5.gamemonetize.co/05v9me4wnyc3flvn250njm13yjh1cacj/",
 "tags": ["levels", "runner", "arcade"],
 "description": "Dash through hostile territory in this action-packed shooter game. Shoot obstacles and enemies while making your way through tough military-themed levels. Gather ammunition and power-ups to boost your chances of survival. Stay alert and strategic to overcome every challenge in your path."
 },
 {
 "id": 29,
 "name": "Ninja Arashi",
 "image": "images/ninjaarashiimage.jpg",
 "slug": "ninjaarashi",
 "gameurl": "https://html5.gamemonetize.co/5dgqcoefxg0lpgt7o5mduxysprpft7cz/",
 "tags": ["adventure", "action", "platformer"],
 "description": "Join the ninja Arashi on a heroic quest to rescue his son from the villainous Orochi. Leap, dash, and battle through perilous levels filled with enemies and traps. Each stage tests your agility, combat skills, and strategy. Experience an action-packed adventure full of danger and heroism."
 },
 {
 "id": 30,
 "name": "Funny Shooter 2",
 "image": "images/funnyshooter2image.jpg",
 "slug": "funnyshooter2",
 "gameurl": "https://html5.gamemonetize.co/6qfki05meirgub3gv0l2qacr2g3wnsch/",
 "tags": ["shooter", "action", "3d"],
 "description": "Step into a 3D first-person shooter where quirky red enemies await your attack. Arm yourself with a variety of weapons and strategies to defeat them. Each level challenges your aim, reflexes, and tactical thinking. Fight your way through and clear every stage for victory."
 },
 {
 "id": 31,
 "name": "Survival Race",
 "image": "images/survivalraceimage.jpg",
 "slug": "survivalrace",
 "gameurl": "https://html5.gamemonetize.co/9km7avlf26r9se5gam8028uq4p6drmx1/",
 "tags": ["racing", "multiplayer", "platformer"],
 "description": "Compete against other players in a high-speed race filled with perilous obstacles. Dodge hazards and navigate tricky paths to stay ahead of the competition. Only those with quick reflexes and smart strategies will make it to the finish line. Push your skills to the limit and aim for victory."
 },
 {
 "id": 32,
 "name": "Offroad Cycle 3D",
 "image": "images/offroadcycle3dimage.jpg",
 "slug": "offroadcycle3d",
 "gameurl": "https://html5.gamemonetize.co/su4m68j4kkt3jsap0867audlbk8hkrpc/",
 "tags": ["racing", "bike", "3d"],
 "description": "Ride your mountain bike across rugged offroad trails in this immersive 3D cycling game. Tackle rough terrain and tricky obstacles while showcasing your stunt skills. Realistic physics make each jump and turn feel authentic. Test your balance and agility as you conquer every challenging trail."
 },
 {
 "id": 33,
 "name": "Rocket Bike Highway Race",
 "image": "images/rocketbikeshighwayraceimage.jpg",
 "slug": "rocketbikeshighwayrace",
 "gameurl": "https://html5.gamemonetize.co/ia1hvdgxut4k7h3kjhjecyx7iwhxi010/",
 "tags": ["racing", "bike", "3d"],
 "description": "Zoom through bustling highways on your rocket-powered bike in this futuristic racing game. Avoid cars and obstacles while maintaining top speed. Activate your rocket boost to surge ahead and leave competitors behind. Push your reflexes to the limit as you race toward victory."
 },
 {
 "id": 34,
 "name": "Block Stack 3D",
 "image": "images/blockstack3dimage.jpg",
 "slug": "blockstack3d",
 "gameurl": "https://html5.gamemonetize.co/trltidnug856kmwd6pglqxsti7v8r3g9/",
 "tags": ["3d", "puzzle", "endless"],
 "description": "Challenge yourself to build towering structures in this 3D puzzle game. Carefully time each block drop to stack them as high as possible. Keep your balance to prevent the tower from toppling over. Aim for maximum height and test your precision with every move."
 },
 {
 "id": 35,
 "name": "Draw the Car Path",
 "image": "images/drawthecarpathimage.jpg",
 "slug": "drawthecarpath",
 "gameurl": "https://html5.gamemonetize.co/9nx8j6pdpcndxl3sxi5xlq9x8d4tc14m/",
 "tags": ["drawing", "puzzle", "levels"],
 "description": "Guide cars to their parking spaces by drawing safe paths in this strategic puzzle game. Plan each route carefully to prevent crashes and ensure smooth traffic flow. Each level increases in complexity, challenging your planning skills. Successfully park all cars to advance and master the game."
 },
 {
 "id": 36,
 "name": "Shell Shockers",
 "image": "images/shellshockersimage.jpg",
 "slug": "shellshockers",
 "gameurl": "https://shellshock.io/",
 "tags": ["shooter", "io", "multiplayer"],
 "description": "Jump into a funny multiplayer FPS where you play as an egg. Hunt down opponents and try to crack them while staying unbroken yourself. Fast reflexes and clever tactics are key to survival. Compete with friends for the ultimate egg-cellent victory."
 },
 {
 "id": 37,
 "name": "Smash Karts",
 "image": "images/smashkartsimage.jpg",
 "slug": "smashkarts",
 "gameurl": "https://smashkarts.io/",
 "tags": ["racing", "action", "multiplayer"],
 "description": "Zoom around thrilling tracks while taking on other racers in this action-packed kart game. Use weapons and power-ups strategically to gain the upper hand. Dodge attacks from opponents while aiming to stay in the lead. Be the last kart standing to claim victory and dominate the race."
 },
 {
 "id": 38,
 "name": "Ships 3D",
 "image": "images/ships3dimage.jpg",
 "slug": "ships3d",
 "gameurl": "https://yp3d.com/ships3d/",
 "tags": ["3d", "action", "multiplayer"],
 "description": "Take control of a powerful warship in thrilling naval battles. Engage in 3D combat against both AI opponents and other players on the open sea. Strategically maneuver and fire to outsmart your enemies. Prove your mastery of the high seas and dominate every battle."
 },
 {
 "id": 39,
 "name": "Goober Dash",
 "image": "images/gooberdashimage.jpg",
 "slug": "gooberdash",
 "gameurl": "https://gooberdash.winterpixel.io",
 "tags": ["io", "platformer", "multiplayer"],
 "description": "Compete with other players in fast-paced obstacle course races. Jump across platforms, dodge traps, and tackle challenging terrain. Every level tests your speed, timing, and agility. Strive to be the first to reach the finish line and claim victory."
 },
 {
 "id": 40,
 "name": "Golf Clash",
 "image": "images/golfclashimage.jpg",
 "slug": "golfclash",
 "gameurl": "https://html5.gamemonetize.co/ywl5omork0jwarou5xrxinfjgxphqh6s/",
 "tags": ["sports", "arcade", "multiplayer"],
 "description": "Step onto the green in this exciting competitive golf game. Perfect your swing and strategy to tackle a variety of courses and challenges. Compete against players from around the world in tournaments. Aim for precision and skill to rise to the top of the leaderboard."
 },
 {
 "id": 41,
 "name": "Smiling Glass",
 "image": "images/smilingglassimage.jpg",
 "slug": "smilingglass",
 "gameurl": "https://html5.gamemonetize.co/58l05tjrdda0semxivccmttcg2laqsbv/",
 "tags": ["satisfying", "puzzle", "clicker"],
 "description": "Pour water into the glass and bring a smile to life in this clever puzzle game. Draw lines to direct the water’s path and solve tricky physics-based challenges. Each level grows more complex, testing your problem-solving skills. Think creatively to guide the water and complete every puzzle."
 },
 {
 "id": 42,
 "name": "Crowdy City IO",
 "image": "images/crowdycityioimage.jpg",
 "slug": "crowdycityio",
 "gameurl": "https://html5.gamemonetize.co/3yrlza468z3vsm3r4mv8v9bi7iv2p3tl/",
 "tags": ["io", "strategy", "multiplayer"],
 "description": "Build the largest following in the city in this competitive io game. Move quickly to gather more followers while steering clear of rival players’ crowds. Strategize your path to grow your numbers without losing momentum. See how big you can make your crowd and dominate the game."
 },
 {
 "id": 43,
 "name": "Archery King 3D",
 "image": "images/archeryking3dimage.jpg",
 "slug": "archeryking3d",
 "gameurl": "https://html5.gamemonetize.co/8zxe2n90tqn7nbpp6z3fqdq1xinsh5j4/",
 "tags": ["3d", "strategy", "sports"],
 "description": "Hone your archery skills in this realistic 3D sports game. Carefully aim your shots while considering wind and distance to hit the target. Each level challenges your precision and focus. Strive for perfect bullseyes to become the ultimate archery champion."
 },
 {
 "id": 44,
 "name": "Scooter Touchgrind",
 "image": "images/scootertouchgrind3dimage.jpg",
 "slug": "scootertouchgrind",
 "gameurl": "https://html5.gamemonetize.co/jkgxa35eeoodbqfj9hlfya96yq75weoi/",
 "tags": ["sports", "3d", "racing"],
 "description": "Scooter Touchgrind Tricks 3D is an exciting scooter driving game where you navigate challenging levels filled with obstacles. Your main objective is to reach the finish line without crashing while maintaining balance. Collect coins along the way to unlock new scooters and explore different styles. As the tracks become more difficult, your reflexes and control will be put to the test."
 },
 {
 "id": 45,
 "name": "Dunk Shot",
 "image": "images/dunkshotimage.jpg",
 "slug": "dunkshot",
 "gameurl": "https://html5.gamemonetize.co/nfungeu1lgtd3uholrztk9r8gwwgtsxl/",
 "tags": ["basketball", "clicker", "arcade"],
 "description": "Dunk Shot Basketball is a fun mobile game where you aim to score as many baskets as possible. The hoop moves up and down, adding a challenge to your shots. Collect stars during gameplay to purchase additional balls and keep playing. Test your timing and precision to achieve high scores within the time limit."
 },
 {
 "id": 46,
 "name": "Uno Online",
 "image": "images/unoonlineimage.jpg",
 "slug": "unoonline",
 "gameurl": "https://html5.gamemonetize.co/wkxitscgm7t9szdj938hq6bs10ms7rse/",
 "tags": ["strategy", "multiplayer", "online"],
 "description": "UNO Online is a strategic card game where the goal is to be the first player to empty your hand. Success requires predicting your opponents’ cards and planning your moves carefully. Choosing the right cards at the right time is key to gaining an advantage. Outsmart your rivals and play strategically to claim victory."
 },
 {
 "id": 47,
 "name": "Snowball IO",
 "image": "images/snowballioimage.jpg",
 "slug": "snowballio",
 "gameurl": "https://html5.gamemonetize.co/v4hz9wmqunchapevb1msrjdrc39f3csy/",
 "tags": ["io", "arcade", "online"],
 "description": "Snowball.io is an exciting multiplayer action game where you control a snow-clearing machine. Build and launch snowballs at your opponents to knock them out of the arena. The last player remaining wins the match. Stay quick and strategic to dominate the snowy battlefield."
 },
 {
 "id": 47,
 "name": "Realistic Lion Hunting",
 "image": "images/realisticlionhuntingimage.jpg",
 "slug": "realisticlionhunting",
 "gameurl": "https://html5.gamemonetize.co/4xgs7sshdp0wpeqsoztn42pdttjiy5jq/",
 "tags": ["animal", "action", "simulator"],
 "description": "Step into the life of a powerful lion in Realistic Lion Hunting, an immersive wildlife simulator. Roam a vast, detailed forest and hunt different animals to survive and progress. Track your prey carefully and navigate the dense wilderness for the ultimate challenge. Experience the excitement and thrill of life in the wild from a predator’s perspective."
 },
 {
 "id": 47,
 "name": "Iron Legion",
 "image": "images/ironlegionimage.jpg",
 "slug": "ironlegion",
 "gameurl": "https://html5.gamemonetize.co/gkeofcoqengjzxlw0b09f2qrng35egbi/",
 "tags": ["online", "action", "3D"],
 "description": "Iron Legion puts you in command of a powerful tank in thrilling modern-era battles. Engage in intense online action as you strategize and outmaneuver opponents. Upgrade your vehicle and master its firepower to dominate the battlefield. Experience the excitement of commanding a formidable war machine in fast-paced combat."
 },
 {
 "id": 48,
 "name": "Narrow One",
 "image": "images/narrowoneimage.jpg",
 "slug": "narrowone",
 "gameurl": "https://narrow.one/",
 "tags": ["online", "shooter", "multiplayer"],
 "description": "Narrow.One is an engaging multiplayer archery game where teamwork is key. Protect your castle while aiming to capture the enemy’s flag. Use your bow and arrows strategically to outplay opponents. Coordinate with your team to achieve victory and dominate the battlefield."
 },
 {
 "id": 49,
 "name": "Hole IO",
 "image": "images/holeioimage.jpg",
 "slug": "holeio",
 "gameurl": "https://holeio.com/",
 "tags": ["io", "online", "multiplayer"],
 "description": "Hole.io is an arcade physics game. Control a black hole and devour everything in sight to grow bigger. Compete against other players in real time to consume the most and dominate the cityscape."
 },
 {
 "id": 50,
 "name": "Only Up! Parkour",
 "image": "images/onlyup!parkourimage.jpg",
 "slug": "onlyup!parkour",
 "gameurl": "https://html5.gamemonetize.co/x0hb11h9lq2347nqv2kvk4bycdlxm9eb/",
 "tags": ["platformer", "parkour", "3d"],
 "description": "Only Up! is a thrilling arcade game that challenges you to scale towering obstacles. Guide your character through a vertical labyrinth filled with tricky hazards. React quickly, jump precisely, and climb skillfully to avoid falling or hitting obstacles. As you advance, levels grow harder with moving platforms and rotating challenges, testing your agility and timing."
 },
 {
 "id": 51,
 "name": "Stair Race 3D",
 "image": "images/stairrace3dimage.jpg",
 "slug": "stairrace3d",
 "gameurl": "https://html5.gamemonetize.co/4zz6wv4zin8z8pqbeb7l0jrpf3gxhl19/",
 "tags": ["3d", "runner", "platformer"],
 "description": "Step into a competitive arena where stair-building skills determine the winner. Collect stair planks and strategically use them to climb to higher platforms. Face off against a variety of challenging opponents as you race to reach the top. Quick thinking and smart placement are key to outbuilding your rivals and claiming victory."
 },
 {
 "id": 52,
 "name": "BitLife",
 "image": "images/bitlifeimage.jpg",
 "slug": "bitlife",
 "gameurl": "https://html5.gamemonetize.co/sunlne8825d1006jux3b1xrl9vda49f1/",
 "tags": ["clicker", "puzzle", "simulator"],
 "description": "BitLife lets you create and live your own life story through choices big and small. Aim to be a model citizen by pursuing love, education, and family, or take a wilder path full of crime and adventure. Experience everything from falling in love to starting prison riots or smuggling goods. Every decision shapes your unique journey, so choose how your story unfolds."
 },
 {
 "id": 53,
 "name": "Moto X3M Winter",
 "image": "images/motox3mwinterimage.jpg",
 "slug": "motox3mwinter",
 "gameurl": "https://html5.gamemonetize.co/1gjwgvl2j0ipdd9ybezeavu04y1nqjen/",
 "tags": ["levels", "bike", "racing"],
 "description": "Moto X3M Winter is an adrenaline-filled stunt bike racing game. Navigate slippery, icy tracks packed with ramps, traps, and tricky obstacles. Perform flips and daring stunts while racing against the clock. Challenge yourself to complete each level as quickly as possible and master every course."
 },
 {
 "id": 54,
 "name": "Rocket Bot Royale",
 "image": "images/rocketbotroyaleimage.jpg",
 "slug": "rocketbotroyale",
 "gameurl": "https://rocketbotroyale2.winterpixel.io/",
 "tags": ["action", "multiplayer", "adventure"],
 "description": "Rocket Bot Royale is an action-packed tank battle game set on a destructible island. Control rocket-powered tanks to shoot, dodge, and outmaneuver opponents. Compete in fast-paced multiplayer matches where strategy and reflexes are key. Be the last bot standing to claim victory and dominate the battlefield."
 },
 {
 "id": 55,
 "name": "Slope 3",
 "image": "images/slope3image.jpg",
 "slug": "slope3",
 "gameurl": "https://slope3.com/",
 "tags": ["io", "racing", "platformer"],
 "description": "Slope 3 is a fast-paced endless runner. Guide a rolling ball down a neon slope while dodging obstacles and staying on track. The farther you go, the faster it gets—test your reflexes and survive as long as you can."
 },
 {
 "id": 56,
 "name": "Gulper IO",
 "image": "images/gulperioimage.jpg",
 "slug": "gulperio",
 "gameurl": "https://slither.io/",
 "tags": ["io", "multiplayer", "action"],
 "description": "Gulper.io is a snake-themed multiplayer game. Eat glowing orbs to grow your snake while avoiding others. Outsmart and trap opponents to climb the leaderboard and become the biggest snake on the map."
 },
 {
 "id": 57,
 "name": "Rocket League",
 "image": "images/rocketleagueimage.jpg",
 "slug": "rocketleague",
 "gameurl": "https://html5.gamemonetize.co/0c57ybsvhtn9xv77swrbiwgtreda0pal/",
 "tags": ["racing", "sports", "online"],
 "description": "Rocket League is an exhilarating sports game where players drive rocket-powered cars to hit a massive ball and score goals. Fast-paced matches demand speed, skill, and precise teamwork. Compete in futuristic arenas and pull off impressive maneuvers. Master both driving and strategy to dominate the game."
 },
 {
 "id": 58,
 "name": "Rise Up",
 "image": "images/riseupimage.jpg",
 "slug": "riseup",
 "gameurl": "https://html5.gamemonetize.co/5jwn8b2ufm7rdafdtnslr9cvioaoh76m/",
 "tags": ["arcade", "strategy", "levels"],
 "description": "Guide your shield with a single finger to keep your balloon safe. Navigate obstacles and clear a path as you ascend higher and higher. React quickly to avoid hazards and maintain your balloon’s safety. Challenge yourself to see how far you can climb."
 }, 
 {
 "id": 59,
 "name": "Mr Racer",
 "image": "images/mrracerimage.jpg",
 "slug": "mrracer",
 "gameurl": "https://html5.gamemonetize.co/y34098moqvr8ueuddbb4vnwxmtorlq4i/",
 "tags": ["racing", "cars", "levels"],
 "description": "MR RACER - Car Racing is an exciting racing game that puts you behind the wheel of high-speed supercars. Dodge traffic and outpace rivals across thrilling tracks. Enjoy easy-to-control car mechanics and immerse yourself in fast-paced racing action. With multiple modes, including Challenge, Chase, and Career, plus 15 upgradable supercars, you can test your skills and become the ultimate racing legend."
 },
 {
 "id": 60,
 "name": "Stick Duel Battle",
 "image": "images/stickduelbattleimage.jpg",
 "slug": "stickduelbattle",
 "gameurl": "https://html5.gamemonetize.co/dm15vv1aak9c1asfg49ji8s7iosbl6tu/",
 "tags": ["2 player", "action", "stickman"],
 "description": "Stick Duel Battle is a hilarious and action-packed stickman fighting game. Battle using realistic weapons and physics across a variety of maps, each demanding unique strategies. Play solo or challenge a friend in two-player mode. The first player to reach a score of five claims victory."
 },
 {
 "id": 61,
 "name": "Gansta Duel",
 "image": "images/ganstaduelimage.jpg",
 "slug": "ganstaduel",
 "gameurl": "https://html5.gamemonetize.co/jxa2s8trml82jl1c2p52en3neqrob1b1/",
 "tags": ["arcade", "action", "levels"], 
 "description": "This action-packed game pits you against hordes of bots in thrilling battles. Advance through levels while upgrading your abilities to increase health and damage. Use creative moves like spinning enemies around to hit multiple opponents or delivering powerful uppercuts for heavy damage. Master your skills to dominate every fight and progress through challenging stages."
 },
 {
 "id": 62,
 "name": "Power Slap",
 "image": "images/powerslapimage.jpg",
 "slug": "powerslap",
 "gameurl": "https://html5.gamemonetize.co/zmlw34hzwakgnkd2nrr1798aqp7xzu7y/",
 "tags": ["arcade", "satisfying", "sports"], 
 "description": "Power Slap is a thrilling slap battle game that tests your timing, reflexes, and precision. Compete in fast-paced duels and out-slap your opponents to climb the leaderboards. With easy one-tap controls, smooth animations, and addictive arcade gameplay, every match is intense. Unlock power-ups, upgrades, and special abilities to gain an advantage and dominate the competition."
 },
 {
 "id": 63,
 "name": "Shadow Fights",
 "image": "images/shadowfightsimage.jpg",
 "slug": "shadowfights",
 "gameurl": "https://html5.gamemonetize.co/juebfqc8k4i9lp3yoki4uftvqt0ks6gb/",
 "tags": ["2 player", "action", "adventure"],
 "description": "The Shadow Fighters are ready for battle, but only one can emerge victorious! Move quickly, throw punches, and dodge incoming attacks. Play solo or challenge a friend in two-player mode. Step into the arena and fight through three intense rounds to claim victory."
 },
 {
 "id": 64,
 "name": "Archer Hero",
 "image": "images/archerheroimage.jpg",
 "slug": "archerhero",
 "gameurl": "https://html5.gamemonetize.co/29wtfvf9jszoc8gibo9dms1f37htul8z/",
 "tags": ["adventure", "levels", "action"],
 "description": "Archer Hero Pro is an engaging game that challenges your archery skills to the fullest. Take on the role of a legendary hero defending your castle from relentless enemy waves. Use your bow and arrow with precision and agility to defeat foes. Face both hordes of foot soldiers and powerful siege engines in this action-packed adventure."
 },
 {
 "id": 65,
 "name": "Jelly Run 2048",
 "image": "images/jellyrun2048image.jpg",
 "slug": "jellyrun2048",
 "gameurl": "https://html5.gamemonetize.co/y51x5nb673umhgqzva6jz2596cd57cqc/",
 "tags": ["arcade", "2048", "runner"],
 "description": "Jelly Run 2048 is a fun and challenging puzzle game that blends the classic 2048 number-merging concept with fast-paced parkour action. Swipe your jelly block left or right to navigate obstacles and link cubes together. Combine matching cubes to double their value and aim to reach 2048 or higher. Each collision with a same-number tile creates a bigger cube, keeping the gameplay exciting and strategic."
 },
 {
 "id": 66,
 "name": "Winter Clash 3D",
 "image": "images/winterclash3dimage.jpg",
 "slug": "winterclash3d",
 "gameurl": "https://html5.gamemonetize.co/ya6quof6a1n40xzz3thz9xekh349abp8/",
 "tags": ["shooter", "action", "multiplayer"],
 "description": "This Christmas, mischievous elves are plotting to seize Santa’s secret base and summon the fearsome Baba Yaga, also known as the Pagan idol. It’s up to you to stop them and defend the holiday spirit. Grab your weapons and face off in the action-packed team shooter Winter Clash 3D. Step into the role of a powerful Santa Claus and capture the Pagan idol on a remote lighthouse island."
 },
 {
 "id": 67,
 "name": "Stickman Sniper",
 "image": "images/stickmansniperimage.jpg",
 "slug": "stickmansniper",
 "gameurl": "https://html5.gamemonetize.co/pnu56ck5blbnesweiw2z1ule6o530x9e/",
 "tags": ["shooter", "action", "stickman"],
 "description": "These sniper games put your precision and stealth to the ultimate test. Step into the shoes of an elite marksman, using your skills to remain unseen while taking out targets from afar. Carefully plan each shot, observe enemy movements, and strike before you’re detected. Only the sharpest shooters can complete the mission and dominate the battlefield."
 },   
 {
 "id": 68,
 "name": "American 18 Wheeler Truck Sim",
 "image": "images/american18wheelertrucksimimage.jpg",
 "slug": "american18wheelertrucksim",
 "gameurl": "https://html5.gamemonetize.co/iktjgjwxwy2kwttz3yml4av97010fgwy/",
 "tags": ["cars", "levels", "simulator"],
 "description": "If you’re a fan of truck driving games, American 18 Wheeler Truck Sim Games 2021 is made for you. Experience the thrill of navigating heavy loads through challenging terrains and unpredictable weather. Test your skills on steep mountains, winding roads, and rugged landscapes as you deliver cargo safely. Master the 18-wheeler simulator, complete your deliveries, and become the ultimate truck driving pro."
 },  
 {
 "id": 69,
 "name": "Billard 8 Ball Pool",
 "image": "images/billard8ballpoolimage.jpg",
 "slug": "billard8ballpool",
 "gameurl": "https://html5.gamemonetize.co/jf2a06o1z5ezy7stb7c4lmm13syg12yk/",
 "tags": ["sports", "arcade", "strategy"],
 "description": "This popular version of billiards challenges players to pocket all the balls from their assigned group—either “solid” or “striped.” After clearing your set, the ultimate goal is to sink the 8-ball to claim victory. Strategy and precision are key to outsmarting your opponent. The first player to complete these steps wins the game and takes the title."
 }, 
 {
 "id": 70,
 "name": "Flip Master",
 "image": "images/flipmasterimage.jpg",
 "slug": "flipmaster",
 "gameurl": "https://html5.gamemonetize.co/t5h6lmvu96x7kk5bj6v5n6999o7mf9f1/",
 "tags": ["3d", "levels", "parkour"],
 "description": "Flip Master puts you in the center of thrilling acrobatics and high-flying parkour action. Pull off jaw-dropping flips, daring tricks, and navigate tricky obstacles with precision. Master your jumps, control your character mid-air, and stick every landing perfectly. Level up your skills, unlock new arenas, and prove you have what it takes to be the ultimate flip champion."
 },
 {
 "id": 71,
 "name": "Curvy Punch 2",
 "image": "images/curvypunch2image.jpg",
 "slug": "curvypunch2",
 "gameurl": "https://html5.gamemonetize.co/us0l69i6kfvo5wa3a2skvifjmcmhj8t6/",
 "tags": ["sports", "action", "levels"],
 "description": "Get ready for the wackiest punch battle around in Curvy Punch, a 3D action-fighting game full of laughs and chaos. Swing your fists in wild, curving punches to take down your opponents in the most unpredictable ways. Dodge obstacles, land perfect hits, and even pull off backflips to stay one step ahead. Every punch is a mix of strategy and silliness—can you master the madness."
 },
 {
 "id": 72,
 "name": "2048 Legend",
 "image": "images/2048legendimage.jpg",
 "slug": "2048legend",
 "gameurl": "https://html5.gamemonetize.co/iqv0wswiozpaxs6s7rdtqdj24ibdrgsa/",
 "tags": ["2048", "arcade", "strategy"],
 "description": "2048 is a fun and addictive puzzle game where you combine matching numbers to reach higher values. While the rules are straightforward, mastering it can be surprisingly tricky. Each move requires strategy and careful planning to maximize your score. If you haven’t tried this modern classic yet, now’s the perfect time to put your skills to the test."
 },
 {
 "id": 73,
 "name": "Rider Online Pro",
 "image": "images/rideronlineproimage.jpg",
 "slug": "rideronlinepro",
 "gameurl": "https://html5.gamemonetize.co/xqxcsqazsozjzy71jb1hn0a54dorg91d/",
 "tags": ["bike", "arcade", "endless"],
 "description": "Get ready for thrilling stunts and nonstop action in Rider! Hop on your motorcycle and spin, flip, and perform daring tricks through an endless, dynamic world. Collect diamonds to unlock new bikes, master combos, and aim for the highest scores. Play Rider Online for free and enjoy endless fun and excitement."
 }, 
 {
 "id": 74,
 "name": "Sniper Simulator",
 "image": "images/snipersimulatorimage.jpg",
 "slug": "snipersimulator",
 "gameurl": "https://html5.gamemonetize.co/ote0vnkghfmoz4n40ifk5isr27q9f5qj/",
 "tags": ["shooter", "simulator", "levels"],
 "description": "Sniper Simulator is a first-person shooting game that puts you in the role of a skilled sniper, handling a variety of classic rifles for realistic training. The game includes an engaging assembly feature, letting players experience the thrill of putting together their weapons while taking precise shots. Easy-to-use controls, stunning visuals, and lifelike sound effects enhance the immersive experience. With realistic gun textures and environments, every shot feels authentic, offering a true-to-life sniper simulation."
 },
 {
 "id": 75,
 "name": "Boat Rescue",
 "image": "images/boatrescueimage.jpg",
 "slug": "boatrescue",
 "gameurl": "https://html5.gamemonetize.co/dlnizm1qjw53qkx4t9kdv0prsp27jdxx/",
 "tags": ["racing", "action", "levels"],
 "description": "American Boat Rescue Simulator puts you in charge of saving people from dangerous waters across a variety of island locations. Complete 100 challenging missions, each requiring skill and quick thinking to reach those in need. Earn points to upgrade your boat, making it faster, stronger, and more stylish as you progress. Track your achievements in the menu and strive to complete them all while enjoying the thrilling rescue experience."
 },
 {
 "id": 76,
 "name": "Momo Horror Story",
 "image": "images/momohorrorstoryimage.jpg",
 "slug": "momohorrorstory",
 "gameurl": "https://html5.gamemonetize.co/5fv1qjs4y57ltbk9q74zpteyeq3p6mob/",
 "tags": ["horror", "action", "shooter"],
 "description": "Momo is a chilling horror game inspired by the legend of the mysterious messaging figure, Momo. Players take on the role of someone who has contacted Momo and must now survive being hunted by the terrifying creature. Complete tasks like turning on generators, finding keys, and securing windows to stay alive until the timer hits zero, when the police arrive to rescue you. The game offers two modes—Classic and Gun—adding different challenges to your fight for survival."
 }, 
 {
 "id": 77,
 "name": "Bus Simulator",
 "image": "images/bussimulatorimage.jpg",
 "slug": "bussimulator",
 "gameurl": "https://html5.gamemonetize.co/dubea73z3y8yy37n10vzmubrovaolu7b/",
 "tags": ["racing", "action", "simulator"],
 "description": "Bus Simulator puts you in the driver’s seat of a city bus, where your job is to follow scheduled routes and transport passengers safely. Navigate busy streets, obey traffic rules, and adapt to realistic urban traffic patterns. Face changing weather conditions and challenging road layouts that test your driving skills. Experience the daily life of a bus driver while keeping passengers happy and on time."
 },
  {
 "id": 78,
 "name": "Stickman Ghost Online",
 "image": "images/stickmanghostonlineimage.jpg",
 "slug": "stickmanghostonline",
 "gameurl": "https://html5.gamemonetize.co/qsd2h427rg6z6gza2xekqsdwgk1dwksa/",
 "tags": ["stickman", "online", "action"],
 "description": "Step into Stickman City and fight to become the last surviving ghost among your rivals. Explore diverse locations and unleash a variety of powerful weapons, chaining combos to defeat enemies and face the ultimate bosses. Collect coins to upgrade your character with new weapons, skills, movements, and skins, enhancing your chances of survival. Your mission is to guide the brave stickman through each level, taking down relentless ninja opponents and saving the city from the evil Stickmans."
 },
 {
 "id": 79,
 "name": "Bird Simulator",
 "image": "images/birdsimulatorimage.jpg",
 "slug": "stickmanghostonline",
 "gameurl": "https://html5.gamemonetize.co/v0ap03gz77p5idffw3d94p8vql3pg23b/",
 "tags": ["simulator", "3d", "animal"],
 "description": "Bird Simulator lets you take flight as a bird in a vibrant forest, exploring treetops, rivers, and open skies. Hunt for food, build nests, and care for your young while interacting with other wildlife. Avoid natural hazards and predators as you navigate the challenges of the wild. Experience the freedom of flight and the thrill of surviving in a realistic woodland ecosystem."
 },
 {
 "id": 80,
 "name": "Nightwalkers IO",
 "image": "images/nightwalkersioimage.jpg",
 "slug": "nightwalkersio",
 "gameurl": "https://html5.gamemonetize.co/99mi8patiemjg6ns0m4apjv6p92csyt2/",
 "tags": ["io", "online", "action"],
 "description": "Nightwalkers.io, or simply Nightwalkers, is a free co-op browser game from JeFawk Games that puts you in the middle of a zombie apocalypse. Survive unique challenges like Apocalypses and the Noise system that draws zombies toward you. Team up with friends to build an impenetrable base, gather resources, craft weapons, and battle endless waves of the undead—or just relax and chat with the 1,000+ daily players. However you play, the goal remains the same: survive, thrive, and take down as many zombies as possible."
 },
 {
 "id": 81,
 "name": "Night Racing",
 "image": "images/nightracingimage.jpg",
 "slug": "nightracing",
 "gameurl": "https://html5.gamemonetize.co/vpyg4xx30zcxx3sv2p8ke2ws7bvwg08v/",
 "tags": ["racing", "cars", "action"],
 "description": "Experience the thrill of high-speed nighttime racing through a vibrant, neon-lit city. Step into the driver’s seat of a powerful sports car and take on daring challenges that test your skills. Complete missions, perform stunts, and outsmart the police as you blaze through the streets. Earn rewards to unlock faster, more powerful cars and prove yourself as the ultimate street racer."
 },
 {
 "id": 82,
 "name": "Deep Space Horror Outpost",
 "image": "images/deepspacehorroroutpostimage.jpg",
 "slug": "deepspacehorroroutpost",
 "gameurl": "https://html5.gamemonetize.co/zyq2hd8j0nld46fklqgj0cyacbpo09mn/",
 "tags": ["horror", "action", "shooter"],
 "description": "Your space cruiser has run out of energy, and the only hope is a remote Deep Space Outpost. To continue your journey, you must find and collect 8 crucial Energy Cells. But the abandoned station isn’t as safe as it seems—humans are gone, and something else lurks in the shadows. Dangerous and relentless, this bloodthirsty presence will test your courage at every turn."
 },
 {
 "id": 83,
 "name": "Zombie Escape",
 "image": "images/zombieescapeimage.jpg",
 "slug": "zombieescape",
 "gameurl": "https://html5.gamemonetize.co/ifcdrnwla32frs6rgrw3ulbbgnip63qq/",
 "tags": ["horror", "action", "puzzle"],
 "description": "Enter Zombie Escape Horror Factory, where a world overrun by zombies tests your survival skills. Join forces with teammates to repair critical generators that hold the key to escaping alive. Every shadow hides a threat, and every step could be your last, keeping fear at the forefront. Will you survive the onslaught long enough to complete the mission and break free from the nightmare."
 },
 {
 "id": 84,
 "name": "Escape Your Birthday",
 "image": "images/escapeyourbirthdayimage.jpg",
 "slug": "escapeyourbirthday",
 "gameurl": "https://html5.gamemonetize.co/karmfagd29qbrrs3vznumevkjw1vjzlz/",
 "tags": ["horror", "action", "puzzle"],
 "description": "It’s your birthday, but something is terribly wrong. You awaken in a locked room with only a cake, a candle, and an unsettling silence surrounding you. What seems like a celebration quickly turns into a sinister puzzle where every object may hold a clue. Search the room, solve the mystery, and escape—before the party takes a darker turn."
 }, 
 {
 "id": 85,
 "name": "Mirage Online Classic",
 "image": "images/mirageonlineclassicimage.jpg",
 "slug": "mirageonlineclassic",
 "gameurl": "https://play.mirageonlineclassic.com/?_gl=1*1lkikim*_ga*MjEzNjk4OTUyNy4xNzU0Nzg5Mjcx*_ga_9Z6N2DZBSW*czE3NTQ3ODkyNzAkbzEkZzAkdDE3NTQ3ODkyNzAkajYwJGwwJGgw",
 "tags": ["multiplayer", "adventure", "online"],
 "description": "Mirage Online Classic is a retro-style MMORPG where you explore a vast fantasy world, battle monsters, complete quests, gather loot, and interact with other players while steadily leveling up your skills, equipment, and abilities."
 }, 
 {
 "id": 86,
 "name": "Gang Fall Party",
 "image": "images/gangfallpartyimage.jpg",
 "slug": "gangfallparty",
 "gameurl": "https://html5.gamemonetize.co/i7uarc0zpakotfo600u3t1j18vdzan26/",
 "tags": ["io", "action", "2 player"],
 "description": "Gang Fall Party throws you into chaotic online brawls where the goal is simple—knock your rivals off the stage with powerful punches. Battles take place on high platforms, and every hit brings you closer to victory or a dramatic fall. Play solo, challenge a friend in 1v1, or team up in 2 Player mode to take on dozens of opponents in the fast-paced Vs All mode. Each match pits you against up to 16–17 fighters, making every round unpredictable and full of action."
 }, 
 {
 "id": 87,
 "name": "Trial Bike Racing Clash",
 "image": "images/trialbikeracingclashimage.jpg",
 "slug": "trialbikeracingclash",
 "gameurl": "https://html5.gamemonetize.co/vqfqbnwpjpv5t77qupxckrz953obu9wd/",
 "tags": ["bike", "multiplayer", "2 player"],
 "description": "Trial Bike Racing Clash kicks off an adrenaline-packed stunt racing adventure where daring riders take on extreme tracks. Face dangerous courses across multiple zones, pushing your skills to the limit with high-speed tricks and precision control. Play solo or challenge a friend in 1 Player or 2 Player modes, testing yourself in both missions and skill-based races. With customizable bikes, unique riders, and a variety of thrilling levels, the competition never stops."
 },
 {
 "id": 88,
 "name": "Slenderman Lost at School",
 "image": "images/slendermanlostatschoolimage.jpg",
 "slug": "slendermanlostatschool",
 "gameurl": "https://html5.gamemonetize.co/24gnovw92p6d8dz6lr9jg0sp3ug9xrmd/",
 "tags": ["horror", "3d", "puzzle"],
 "description": "Slenderman Lost at School drops you into a creepy, abandoned campus haunted by the legendary Slenderman. To survive, you’ll need to search the halls for clues, gather items, and solve puzzles that open the path to freedom. Blending stealth, suspense, and strategy, the game keeps tension high as you creep through shadowy corridors and avoid Slenderman’s deadly stare. Every corner hides a secret—and only sharp instincts will help you escape before it’s too late."
 },
 {
 "id": 89,
 "name": "Stickman Sports Badminton",
 "image": "images/stickmansportsbadmintonimage.jpg",
 "slug": "stickmansportsbadminton",
 "gameurl": "https://html5.gamemonetize.co/c6zx75jasrpsm0b6a4utgps07dxhs3h5/",
 "tags": ["sports", "stickman", "2 player"],
 "description": "Stickman Sports Badminton brings quirky characters together for a fast and fun badminton showdown. With realistic shuttle physics, exciting power-ups like giant rackets, fire smashes, and speed boosts—alongside tricky debuffs that slow you down—the action stays fresh and unpredictable. Play solo or challenge a friend in 1v1 matches, with options for Normal or Hard difficulty when facing the CPU. Customize your match length with 5, 7, or 9 sets and prove who truly rules the court."
 },
{
 "id": 90,
 "name": "Command Strike FPS",
 "image": "images/commandstrikefpsimage.jpg",
 "slug": "commandstrikefps",
 "gameurl": "https://html5.gamemonetize.co/fiogowuzog6jowbgvabdxrcqaub4cubc/",
 "tags": ["shooter", "action", "multiplayer"],
 "description": "Command Strike FPS delivers high-speed first-person shooting with both offline and online action across diverse, well-designed maps. Choose from modes like Deathmatch, Team Deathmatch, Free-for-All, Flag Capture, or Mission Mode, each offering unique tactical challenges and nonstop firefights. With an arsenal of weapons, explosives, and gear at your disposal, you’ll step into the boots of an elite soldier and fight to dominate every battle."
 },
{
 "id": 91,
 "name": "Zombie Survival 2",
 "image": "images/zombiesurvival2image.jpg",
 "slug": "zombiesurvival2",
 "gameurl": "https://html5.gamemonetize.co/83siph0wqz04p8mp137w5uch7vk5t0nu/",
 "tags": ["adventure", "action", "strategy"],
 "description": "Step into Zombie Survival 2, a relentless fight for life where danger waits in every shadow. Explore ruined cities, haunted woods, and empty backstreets to gather precious supplies—from crude weapons and crossbows to vital medkits—while carefully managing what lasts and what breaks. Use over 20 craftable upgrades, from gear and weapons to traps, to push back endless hordes and towering bosses that test both strategy and courage. Strengthen your base, balance your inventory, and see how long you can endure against the rising tide of the undead."
 },
{
 "id": 92,
 "name": "Silent Fear",
 "image": "images/silentfearimage.jpg",
 "slug": "silentfear",
 "gameurl": "https://html5.gamemonetize.co/kl1jn8oiq2ah7pzb9n3oxnco25smwc2b/",
 "tags": ["horror", "action", "runner"],
 "description": "Silent Fear plunges you into a terrifying world where danger lurks in the dark and even the faintest noise can betray you. With nothing but makeshift tools—a saw, a phone, and a shattered gun barrel—you must survive against twisted creatures that stalk everything living. The infected hunt with unrelenting persistence, forcing you to think fast and act smarter. As humanity’s last hope, survival comes down to every heartbeat, every step, and every desperate choice."
 },
{
 "id": 93,
 "name": "Save the Dummy",
 "image": "images/savethedummyimage.jpg",
 "slug": "savethedummy",
 "gameurl": "https://html5.gamemonetize.co/rrcjjjeau91stfs3fcoopnr101g1awgh/",
 "tags": ["drawing", "puzzle", "strategy"],
 "description": "Save the Dummy is a lighthearted physics puzzle game where you must rescue a floppy ragdoll from odd traps and tricky setups. Every stage asks you to interact with ropes, platforms, and obstacles to set off reactions that guide the dummy to safety. The mix of creative problem-solving and unpredictable physics keeps the gameplay fun and engaging. Each completed puzzle rewards you with a mix of humor and satisfaction."
 },
{
 "id": 94,
 "name": "Slowroads IO",
 "image": "images/slowroadsioimage.jpg",
 "slug": "slowroadsio",
 "gameurl": "https://slowroads.io/",
 "tags": ["cars", "io", "racing"],
 "description": "Slow Roads is a relaxing driving simulation where you cruise endlessly along procedurally generated roads that stretch through calm, scenic landscapes. With no goals or finish lines, the game focuses on the meditative joy of the journey itself, letting you enjoy the freedom of the open road. Customizable settings like weather, time of day, and even an autodrive option make every drive a unique and soothing escape."
 },
{
 "id": 95,
 "name": "Slope",
 "image": "images/slopeimage.jpg",
 "slug": "slope",
 "gameurl": "https://ubggo.github.io/ub-games/slope/",
 "tags": ["io", "platformer", "runner"],
 "description": "Race a neon ball down an endless, gravity-defying slope where reflexes are your only ally. Dodge sharp turns, treacherous platforms, and glowing obstacles as your speed climbs into adrenaline territory. Every run is a fresh test of focus—how far can you push the limits before the track claims you."
 },
{
 "id": 96,
 "name": "Snow Rider 3D",
 "image": "images/snowrider3dimage.jpg",
 "slug": "snowrider3d",
 "gameurl": "https://ubggo.github.io/ub-games/snowrider3d/",
 "tags": ["runner", "sports", "endless"],
 "description": "Strap in and shred icy slopes at breathtaking speed, weaving through trees, rocks, and frosty obstacles in a high-octane downhill thrill ride. Collect gifts along the way to boost your score and unlock sleek new sleds that keep the runs feeling fresh. With smooth 3D visuals and responsive controls, every descent becomes a wintry rush you won’t want to end."
 },
{
 "id": 97,
 "name": "Retro Bowl",
 "image": "images/retrobowlimage.jpg",
 "slug": "retrobowl",
 "gameurl": "https://ubggo.github.io/ub-games/retrobowl/",
 "tags": ["runner", "sports", "endless"],
 "description": "Strap in and shred icy slopes at breathtaking speed, weaving through trees, rocks, and frosty obstacles in a high-octane downhill thrill ride. Collect gifts along the way to boost your score and unlock sleek new sleds that keep the runs feeling fresh. With smooth 3D visuals and responsive controls, every descent becomes a wintry rush you won’t want to end."
 },
{
 "id": 98,
 "name": "Basketball Line",
 "image": "images/basketballlineimage.jpg",
 "slug": "basketballline",
 "gameurl": "https://html5.gamemonetize.co/q3kmzjunadtxkw3c55y3465ru3m9vknq/",
 "tags": ["basketball", "sports", "drawing"],
 "description": "Basketball Line is a creative puzzle game where you draw lines to guide the falling ball into the hoop. Time your drawings carefully to ensure a perfect shot. Watch out for bombs that can ruin your play. Keep drawing and dunking to score big."
 },
{
 "id": 98,
 "name": "Classic Car Parking",
 "image": "images/classiccarparkingimage.jpg",
 "slug": "classiccarparking",
 "gameurl": "https://html5.gamemonetize.co/h2756112zb490g5tjjpoq6av147lo7i7/",
 "tags": ["cars", "levels", "puzzle"],
 "description": "Classic Car Parking is a realistic driving game that puts your precision and control to the test. Take the wheel of vintage cars and carefully maneuver through tight spaces, narrow paths, and challenging obstacles. Each mission requires perfect parking without collisions. It’s more than just gameplay—it’s a true challenge of skill and patience."
 },
{ 
 "id": 99, 
 "name": "Pop the Bubbles",
 "image": "images/popthebubblesimage.jpg",
 "slug": "popthebubbles",
 "gameurl": "https://html5.gamemonetize.co/s7e6xmuq8kwidnku964f8072hflua90i/",
 "tags": ["satisfying", "levels", "puzzle"],  
 "description": "This relaxing bubble-popping game is the perfect way to unwind after a busy day. Enjoy vibrant colors, soothing music, and endless levels designed to melt away stress. With simple gameplay and a calming atmosphere, it offers the ideal mix of fun and relaxation. Jump in now and experience a peaceful escape filled with lighthearted enjoyment."
},
{ 
 "id": 100, 
 "name": "Airport Manager",
 "image": "images/airportmanagerimage.jpg",
 "slug": "airportmanager", 
 "gameurl": "https://html5.gamemonetize.co/sg0qh3o90hxhdvsggxqfuwuihhhsr3vo/",
 "tags": ["clicker", "levels", "puzzle"],  
 "description": "Step into the role of an Airport Manager and see if you can successfully run your own airline in Airport Manager Online. Take on tasks like handling security checks, checking boarding passes, flying planes, and even helping travelers find their lost items. Use your management skills to grow and improve your airport, turning it into the top destination for passengers. With exciting challenges and endless fun, this game offers a truly engaging airport adventure."
},
{ 
 "id": 101, 
 "name": "Sausage Flip",
 "image": "images/sausageflipimage.jpg",
 "slug": "sausageflip", 
 "gameurl": "https://html5.gamemonetize.co/sg0qh3o90hxhdvsggxqfuwuihhhsr3vo/",
 "tags": ["clicker", "levels", "puzzle"],  
 "description": "In Sausage Flip Free, youre not just any sausage. You’re a daring, bouncy hero on a mission to overcome wild levels full of danger, timing, and precision! This action, casual game blends goofy fun with real skill challenges! Tap to launch your sausage with a perfect flip! Launch the sausage on the vine and keep moving to the next pot or shelf, etc. Use your perfect skills to master each tricky obstacle. Cross the finish line to win."
}

]